Revit 2024 API
DividedPath Class
 An element that consists of a set of points distributed along a path which consists of a connected set of curves and edges.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class DividedPath : Element
Visual Basic
Public Class DividedPath _
	Inherits Element
Visual C++
public ref class DividedPath : public Element
Remarks
 The points can be the result of a uniform distribution along the path. The type of the distribution is determined by a selected 'layout'. The distance between the layout points depends on the path, the layout, and layout specific settings. In addition, points can also be the result of intersecting the path with other elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.DividedPath
See Also
DividedPath Members
Autodesk.Revit.DB Namespace